Data frame készítése szótárból.

In [1]:
# import pandas as pd 
import pandas as pd

# create dataframe from dictionary in `df`
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Emma', 'Frank', 'Grace', 'Henry', 'Isabella', 'Jack', 'Karen', 'Liam', 'Maria', 'Nathan', 'Olivia', 'Peter'],
    'Age': [25, 30, 45, 20, 28, 50, 32, 37, 23, 42, 29, 31, 48, 27, 36, 41],
    'Sex': ['F', 'M', 'M', 'F', 'F', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'F', 'M']
}

df = pd.DataFrame(data)

Új oszlop hozzáadása

In [2]:
# Add new column 'Status' to the dataframe
df['Status'] = ['Student', 'Worker', 'Worker', 'Student', 'Student', 'Retiree', 'Worker', 'Worker', 'Student', 'Worker', 'Student', 'Worker', 'Retiree', 'Student', 'Worker', 'Worker']

Átnevezés

In [3]:
ren_cols = {
    'Name': 'Full Name',
    'Age': 'Years Old',
    'Sex': 'Gender'
}

df = df.rename(columns=ren_cols)

In [4]:
df.head(5)

  Full Name  Years Old Gender   Status
0     Alice         25      F  Student
1       Bob         30      M   Worker
2   Charlie         45      M   Worker
3     Diana         20      F  Student
4      Emma         28      F  Student

Töröld a 4. indexű sort.

In [ ]:
df.drop([4], axis=0, inplace=True)

Töröld a 7 és 9 indexű sorokat

In [ ]:
df.drop([7,9], axis=0, inplace=True)

Töröld azokat a sorokat, ahol a Full name = Bob

In [7]:
df.drop(df[df['Full Name'] == 'Bob'].index, axis=0, inplace=True)

Sor hozzáadása

In [9]:
new_row = {
    'Full Name': 'Emma',
    'Years Old': 28, 
    'Gender': 'F',
    'Status': 'Student'
}

df = pd.concat([df,pd.DataFrame([new_row])], ignore_index=True)

In [10]:
df.tail()

   Full Name  Years Old Gender   Status
11     Maria         48      F  Retiree
12    Nathan         27      M  Student
13    Olivia         36      F   Worker
14     Peter         41      M   Worker
15      Emma         28      F  Student

Több sor hozzáadás

In [11]:
df2 = pd.DataFrame({
    'Full Name': ['Bob', 'Emma', 'Henry', 'Jack'],
    'Years Old': [30, 28, 37, 42],
    'Gender': ['M', 'F', 'M', 'M'],
    'Status': ['Worker', 'Student', 'Worker', 'Worker'],
})

df = pd.concat([df,df2], ignore_index=True)

Filter the data

Filter data with Gender as F, Status as Student, and Years Old' greater than 20 years old. After filtering store data in a new DataFrame name Filter_Data.